#include <iostream>
#include <random>
#include "../../../libs/libGame/Game.hpp"
#include "../../../libs/libError/Error.hpp"

/**
* @brief Тест проверки выигрыша
* @details Создается массив из 8 чистых полей
*          На каждом поле выстраивается одна
*          из 8 возможных выигрышных комбинации
*          Каждая комбинация проверяется
*          тестируемой функцией
*/
bool test_check_win_state();

/**
* @brief Тест установки хода на поле
* @details В каждую i-ю пустую клетку поочередно
*          устанавливается фигура, затем попытка
*          установить фигуру в эту же клетку
*          Далее попытка установить в
*          произвольную клетку за пределами поля
*/
bool test_make_step();