#include <iostream>
#include <random>
#include <ctime>
#include "../libs/libUI/UI.hpp"
#include "../libs/libAI/AI.hpp"
#include "../libs/libGame/Game.hpp"
#include "../libs/libError/Error.hpp"

/**
* @brief Запуск всех тестов
*/
bool run_all_tests();

/**
* @brief Тест выбора режима
* @details Из тестового файла в стандартный поток
*          ввода загружаются входные данные
*          и запускается тестируемая функция
*          Сначала тестируются корректные данные
*          затем некорректные
*/
bool test_select_mode();

/**
* @brief Тест чтения числа > 0
* @details Из тестового файла в стандартный поток
*          ввода загружаются входные данные
*          и запускается тестируемая функция
*          Сначала тестируются корректные данные
*          затем некорректные
*/
bool test_read_step();

/**
* @brief Тест проверки выигрыша
* @details Создается массив из 8 чистых полей
*          На каждом поле выстраивается одна
*          из 8 возможных выигрышных комбинации
*          Каждая комбинация проверяется
*          тестируемой функцией
*/
bool test_check_win_state();

/**
* @brief Тест установки хода на поле
* @details В каждую i-ю пустую клетку поочередно
*          устанавливается фигура, затем попытка
*          установить фигуру в эту же клетку
*          Далее попытка установить в произвольную
*          клетку за пределами поля
*/
bool test_make_step();

/**
* @brief Тест хода компьютером
* @details Проверка на 100000 итерациях
*          генерирования хода компьютором
*          в клетку с номером от 1 до 9
*/
bool test_computer_step();